; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	spectrograph2 - mode
	thermograph0 - mode
	image1 - mode
	Star0 - direction
	GroundStation1 - direction
	Star5 - direction
	GroundStation2 - direction
	Star3 - direction
	Star4 - direction
	Phenomenon6 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 spectrograph2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
)
(:goal (and
	(pointing satellite0 Star3)
	(have_image Phenomenon6 thermograph0)
	(have_image Star7 thermograph0)
	(have_image Star8 image1)
	(have_image Star9 spectrograph2)
	(have_image Star10 image1)
	(have_image Phenomenon11 image1)
	(have_image Phenomenon12 image1)
	(have_image Star13 spectrograph2)
	(have_image Phenomenon14 thermograph0)
	(have_image Phenomenon15 thermograph0)
	(have_image Phenomenon16 spectrograph2)
	(have_image Planet17 thermograph0)
))

)

; plan
1. (turn_to satellite0 groundstation2 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 13
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 13
3. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 0 of 13
4. (turn_to satellite0 star8 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star8)
   goals met: 0 of 13
5. (take_image satellite0 star8 instrument0 image1)
   added: (have_image star8 image1)
   goals met: 1 of 13
6. (turn_to satellite0 star10 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star10)
   goals met: 1 of 13
7. (take_image satellite0 star10 instrument0 image1)
   added: (have_image star10 image1)
   goals met: 2 of 13
8. (turn_to satellite0 phenomenon16 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 phenomenon16)
   goals met: 2 of 13
9. (take_image satellite0 phenomenon16 instrument0 spectrograph2)
   added: (have_image phenomenon16 spectrograph2)
   goals met: 3 of 13
10. (turn_to satellite0 phenomenon12 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 13
11. (take_image satellite0 phenomenon12 instrument0 image1)
   added: (have_image phenomenon12 image1)
   goals met: 4 of 13
12. (turn_to satellite0 phenomenon11 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon11)
   goals met: 4 of 13
13. (take_image satellite0 phenomenon11 instrument0 image1)
   added: (have_image phenomenon11 image1)
   goals met: 5 of 13
14. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 5 of 13
15. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 5 of 13
16. (turn_to satellite0 star4 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star4)
   goals met: 5 of 13
17. (calibrate satellite0 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 5 of 13
18. (turn_to satellite0 phenomenon14 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon14)
   goals met: 5 of 13
19. (take_image satellite0 phenomenon14 instrument1 thermograph0)
   added: (have_image phenomenon14 thermograph0)
   goals met: 6 of 13
20. (turn_to satellite0 phenomenon15 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon15)
   goals met: 6 of 13
21. (take_image satellite0 phenomenon15 instrument1 thermograph0)
   added: (have_image phenomenon15 thermograph0)
   goals met: 7 of 13
22. (turn_to satellite0 phenomenon6 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon6)
   goals met: 7 of 13
23. (take_image satellite0 phenomenon6 instrument1 thermograph0)
   added: (have_image phenomenon6 thermograph0)
   goals met: 8 of 13
24. (turn_to satellite0 planet17 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet17)
   goals met: 8 of 13
25. (take_image satellite0 planet17 instrument1 thermograph0)
   added: (have_image planet17 thermograph0)
   goals met: 9 of 13
26. (turn_to satellite0 star13 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 star13)
   goals met: 9 of 13
27. (take_image satellite0 star13 instrument1 spectrograph2)
   added: (have_image star13 spectrograph2)
   goals met: 10 of 13
28. (turn_to satellite0 star7 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star7)
   goals met: 10 of 13
29. (take_image satellite0 star7 instrument1 thermograph0)
   added: (have_image star7 thermograph0)
   goals met: 11 of 13
30. (turn_to satellite0 star9 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star9)
   goals met: 11 of 13
31. (take_image satellite0 star9 instrument1 spectrograph2)
   added: (have_image star9 spectrograph2)
   goals met: 12 of 13
32. (turn_to satellite0 star3 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star3)
   goals met: 13 of 13
